uhnp/src/Documents/КритерииОценкиПоставщиков/КритерииОценкиПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КритерииОценкиПоставщиков</name>
  <comment>(УХ)</comment>
  <registerRecords>InformationRegister.КритерииОценкиПоставщиков</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправления</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПроцессаВыбора</name>
    <type>
      <types>CatalogRef.НастройкиПроцессаВыбора</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализа</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КритерииОценки</name>
    <attributes>
      <name>КритерийОценки</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Эксперты</name>
    <attributes>
      <name>Эксперт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ФункциональноеНаправление</name>
      <type>
        <types>CatalogRef.ФункциональныеНаправления</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетЭтапОценки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/КритерииОценкиПоставщиков/КритерииОценкиПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КритерииОценкиПоставщиков</name>
  <comment>(УХ)</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ГлубинаАнализа</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Критерий</name>
    <type>
      <types>CatalogRef.КритерииВыбора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФункциональноеНаправления</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/КритерииОценкиПоставщиков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДлительностьОценки) Тогда
		ДлительностьОценки = 1;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
	КонецЕсли;	
	

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Пользователи.ТекущийПользователь();
	НастройкаПроцессаВыбора = ПредопределенноеЗначение("Справочник.НастройкиПроцессаВыбора.ПустаяСсылка");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.КритерииОценкиПоставщиков.Записывать = Истина;
		Движение = Движения.КритерииОценкиПоставщиков.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ФункциональноеНаправления = ФункциональноеНаправления;
	//
	
КонецПроцедуры
#КонецЕсли
